# MaterialId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Segment..::..MaterialId Property
Segment Class See Also
---
The ElementId of the MaterialElem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId MaterialId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
```

# See Also
Segment Class
Autodesk.Revit.DB Namespace